v2206/solver_ADMFoam/ADTank_orig/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    allBoundary
    {
        type            noSlip;
    }
    
    top
    {
        type            symmetry;
    }
    GeoTank
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    GeoShaft
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }


   
    
}

// ************************************************************************* //
