v2206/solver_ADMFoam/ADTank_orig/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 20;

boundaryField
{
    allBoundary
    {
        type            zeroGradient;
    }

    top
    {
        type            symmetry;
    }
    GeoTank
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    GeoShaft
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
